DataProcessors/Renault_ЗагрузкаЦентрализованныхАкций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_ЗагрузкаЦентрализованныхАкций</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/Renault_ЦентрализованныеАкции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_ЦентрализованныеАкции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CRM_ДилерскиеЦентры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТолькоMyRenault</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчавствуютДругиеМарки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДаноСогласиеНаУчастие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчастиеПодтверждено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦентральныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАкции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыЦентрализованныхАкций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозрастОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозрастДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПробегОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПробегДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьВключаетРаботы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длительность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоРаботаДилера</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реферанс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PNC_БезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PCL_БезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Модели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантКомплектации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГУР</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АС</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СФ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДвигателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыДвигателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьЗЧВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомпенсацияДилеру</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаВРублях</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаВПроцентах</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦентральныйУИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВариантыКомплектации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантКомплектации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГУР</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СФ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДвигателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыДвигателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/Renault_ЗагрузкаЦентрализованныхАкций/Ext/ObjectModule.bsl
Перем ВебСервис;

Функция ПолучитьВебСервис()
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	
	АдресWS	 = Настройки.АдресWsGate;
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	ЛогинWS = Настройки.ЛогинДоступаКВебСервисам;
	
	АдресWS = СтрЗаменить(АдресWS, "ws/Actions.ws?wsdl", "");
	ВСОпределение = Новый WSОпределения(СокрЛП(АдресWS) + "ws/Actions.ws?wsdl",
									СокрЛП(ЛогинWS), СокрЛП(ПарольWS));
	ВебСервис = Новый WSПрокси(ВСОпределение, "http://renault-nissan.com/schema/actions", 
							   "Renault_Actions", "Renault_ActionsSoap12");
	ВебСервис.Пользователь	 = СокрЛП(ЛогинWS);
	ВебСервис.Пароль		 = СокрЛП(ПарольWS);
	
	Возврат ВебСервис;
	
КонецФункции

Процедура ОбработкаНаСервере() Экспорт
	
	СтрокаБИРов = "";
	ВыборкаДЦ = Справочники.CRM_ДилерскиеЦентры.Выбрать();
	Пока ВыборкаДЦ.Следующий() Цикл
		Если ВыборкаДЦ.BIR <> "" И ВыборкаДЦ.ПометкаУдаления = Ложь Тогда
			СтрокаБИРов = СтрокаБИРов + ВыборкаДЦ.BIR + ";";
		КонецЕсли;
	КонецЦикла;
	Если Прав(СтрокаБИРов, 1) = ";" Тогда
		СтрокаБИРов = Лев(СтрокаБИРов, СтрДлина(СтрокаБИРов)-1);
	КонецЕсли;
	
	ВебСервис = ПолучитьВебСервис();
	
	ТаблицаДанныхXDTO = ВебСервис.GetActions(СтрокаБИРов);
	//ИдентификаторИБ = Константы.Renault_BIR_db.Получить();
	//Если НЕ ЗначениеЗаполнено(ИдентификаторИБ) Тогда
	//	Возврат;
	//КонецЕсли;
	//ТаблицаДанныхXDTO = ВебСервис.GetChanges(ИдентификаторИБ);
	Сериализатор = Новый СериализаторXDTO(ВебСервис.ФабрикаXDTO);
	ТаблицаДанных = Сериализатор.ПрочитатьXDTO(ТаблицаДанныхXDTO);
	
	ЗаписатьДанныеВБазу(ТаблицаДанных);
	ПолучитьПодтверждения();
	
КонецПроцедуры

Процедура ЗаписатьДанныеВБазу(ТаблицаДанных)
	
	ВыборкаДЦ = Справочники.CRM_ДилерскиеЦентры.Выбрать();
	
	Пока ВыборкаДЦ.Следующий() Цикл
		
		Для Каждого Строка ИЗ ТаблицаДанных Цикл
			
			Если Строка.BIR <> ВыборкаДЦ.BIR Тогда
				Продолжить;
			КонецЕсли;
			
			Отбор = Новый Структура;
			Отбор.Вставить("ЦентральныйИдентификатор", Строка.СсылкаИдентификатор);
			//Отбор.Вставить("ДилерскийЦентр", ВыборкаДЦ.Ссылка);
			ВыборкаСпр = Справочники.Renault_ЦентрализованныеАкции.Выбрать(, ВыборкаДЦ.Ссылка, Отбор);
			Если ВыборкаСпр.Следующий() Тогда
				СпрОбъект = ВыборкаСпр.ПолучитьОбъект();
			Иначе
				СпрОбъект = Справочники.Renault_ЦентрализованныеАкции.СоздатьЭлемент();
				СпрОбъект.Владелец = ВыборкаДЦ.Ссылка;
				СпрОбъект.ДилерскийЦентр = ВыборкаДЦ.Ссылка;
				СпрОбъект.ЦентральныйИдентификатор = Строка.СсылкаИдентификатор;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СпрОбъект, Строка);
			Если ЗначениеЗаполнено(Строка.ТипАкции) Тогда
				СпрОбъект.ТипАкции = Перечисления.Renault_ТипыЦентрализованныхАкций[Строка.ТипАкции];
			КонецЕсли;
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВнешняяТаб.КомпенсацияДилеру,
			|	ВнешняяТаб.МодельАртикул,
			|	ВнешняяТаб.СкидкаВПроцентах,
			|	ВнешняяТаб.СкидкаВРублях,
			|	ВнешняяТаб.СтоимостьВсего,
			|	ВнешняяТаб.СтоимостьЗЧВсего,
			|	ВнешняяТаб.УИД,
			|	ВнешняяТаб.Примечание
			|ПОМЕСТИТЬ Врем
			|ИЗ &ВнешняяТаб КАК ВнешняяТаб
			|;
			|ВЫБРАТЬ
			|	Врем.КомпенсацияДилеру,
			|	Врем.МодельАртикул,
			|	Врем.СкидкаВПроцентах,
			|	Врем.СкидкаВРублях,
			|	Врем.СтоимостьВсего,
			|	Врем.СтоимостьЗЧВсего,
			|	Врем.УИД КАК ЦентральныйУИД,
			|	Врем.Примечание,
			|	Модели.УИД
			|ИЗ Врем КАК Врем
			|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_ЦентрализованныеАкции.Модели КАК Модели
			|	ПО Модели.ЦентральныйУИД = Врем.УИД
			|	И Модели.Ссылка = &Ссылка";
			Запрос.УстановитьПараметр("ВнешняяТаб", Строка.Модели);
			Запрос.УстановитьПараметр("Ссылка", СпрОбъект.Ссылка);
			Результат = Запрос.Выполнить().Выгрузить();
			СпрОбъект.Модели.Очистить();
			Отбор = Новый Структура;
			Отбор.Вставить("ЭтоРаботаДилера", Истина);
			РаботыДилера = СпрОбъект.Работы.Выгрузить(Отбор);
			СпрОбъект.Работы.Очистить();
			СпрОбъект.ВариантыКомплектации.Очистить();
			СпрОбъект.Номенклатура.Очистить();
			
			Для Каждого СтрокаМодели ИЗ Результат Цикл
				НоваяСтрокаМодель = СпрОбъект.Модели.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаМодель, СтрокаМодели);
				//НоваяСтрока.ЦентральныйУИД = СтрокаМодели.УИД;
				Если НоваяСтрокаМодель.УИД = "" Тогда
					НоваяСтрокаМодель.УИД = Новый УникальныйИдентификатор();
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаМодели.МодельАртикул) Тогда
					НоваяСтрокаМодель.Модель = Справочники.Модели.НайтиПоРеквизиту("Артикул", СтрокаМодели.МодельАртикул);
				КонецЕсли;
				//Если ЗначениеЗаполнено(СтрокаМодели.ВариантКомплектацииАртикул) Тогда
				//	НоваяСтрокаМодель.ВариантКомплектации = Справочники.ВариантыКомплектации.НайтиПоРеквизиту("Артикул", СтрокаМодели.ВариантКомплектацииАртикул);
				//КонецЕсли;
				//Если ЗначениеЗаполнено(СтрокаМодели.ТипДвигателя) Тогда
				//	НоваяСтрокаМодель.ТипДвигателя = Справочники.ТипыДвигателей.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаМодели.ТипДвигателя));
				//КонецЕсли;
				СтоимостьВсегоРаботы = 0;
				СтоимостьВсегоЗЧ = 0;
				Отбор = Новый Структура();
				Отбор.Вставить("УИД", НоваяСтрокаМодель.ЦентральныйУИД);
				МассивСтрок = Строка.Работы.НайтиСтроки(Отбор);
				Для Каждого СтрокаРаботы ИЗ МассивСтрок Цикл
					НоваяСтрока = СпрОбъект.Работы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаботы);
					НоваяСтрока.Работа = Справочники.Автоработы.НайтиПоРеквизиту("Артикул", СтрокаРаботы.Работа);
					НоваяСтрока.УИД = НоваяСтрокаМодель.УИД;
					СтоимостьВсегоРаботы = СтоимостьВсегоРаботы + НоваяСтрока.СтоимостьРаботы;
				КонецЦикла;
				Отбор = Новый Структура();
				Отбор.Вставить("УИД", НоваяСтрокаМодель.УИД);
				МассивСтрок = РаботыДилера.НайтиСтроки(Отбор);
				Для Каждого СтрокаРаботы ИЗ МассивСтрок Цикл
					НоваяСтрока = СпрОбъект.Работы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаботы);
					//НоваяСтрока.Работа = Справочники.Автоработы.НайтиПоРеквизиту("Артикул", СтрокаРаботы.Работа);
					НоваяСтрока.УИД = НоваяСтрокаМодель.УИД;
					Если НЕ СпрОбъект.СтоимостьВключаетРаботы Тогда
						СтоимостьВсегоРаботы = СтоимостьВсегоРаботы + НоваяСтрока.СтоимостьРаботы;
					КонецЕсли;
				КонецЦикла;
				Отбор = Новый Структура();
				Отбор.Вставить("УИД", НоваяСтрокаМодель.ЦентральныйУИД);
				МассивСтрок = Строка.Номенклатура.НайтиСтроки(Отбор);
				Для Каждого СтрокаНоменклатура ИЗ МассивСтрок Цикл
					НоваяСтрока = СпрОбъект.Номенклатура.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНоменклатура);
					НоваяСтрока.Реферанс = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", СтрокаНоменклатура.РеферансАртикул);
					НоваяСтрока.Артикул = СтрокаНоменклатура.РеферансАртикул;
					НоваяСтрока.УИД = НоваяСтрокаМодель.УИД;
					СтоимостьВсегоЗЧ = СтоимостьВсегоЗЧ + НоваяСтрока.Стоимость;
				КонецЦикла;
				МассивСтрок = Строка.ВариантыКомплектации.НайтиСтроки(Отбор);
				Для Каждого СтрокаВариант ИЗ МассивСтрок Цикл
					НоваяСтрока = СпрОбъект.ВариантыКомплектации.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВариант);
					НоваяСтрока.ВариантКомплектации = Справочники.ВариантыКомплектации.НайтиПоРеквизиту("Артикул", СтрокаВариант.ВариантКомплектацииАртикул);
					Если ЗначениеЗаполнено(СтрокаВариант.ТипДвигателя) Тогда
						НоваяСтрока.ТипДвигателя = Справочники.ТипыДвигателей.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаВариант.ТипДвигателя));
					КонецЕсли;
					НоваяСтрока.УИД = НоваяСтрокаМодель.УИД;
				КонецЦикла;
				НоваяСтрокаМодель.СтоимостьВсего = СтоимостьВсегоРаботы + СтоимостьВсегоЗЧ;
			КонецЦикла;
			СпрОбъект.Записать();
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьПодтверждения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ЦентрализованныеАкции.Владелец.BIR КАК BIR,
	|	Renault_ЦентрализованныеАкции.ЦентральныйИдентификатор КАК ЦентральныйИдентификатор
	|ИЗ
	|	Справочник.Renault_ЦентрализованныеАкции КАК Renault_ЦентрализованныеАкции
	|ГДЕ
	|	Renault_ЦентрализованныеАкции.ДаноСогласиеНаУчастие = ИСТИНА
	|	И Renault_ЦентрализованныеАкции.УчастиеПодтверждено = ЛОЖЬ";
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() <> 0 Тогда
		
		Сериализатор = Новый СериализаторXDTO(ВебСервис.ФабрикаXDTO);
		СериализованнаяТаблица = Сериализатор.ЗаписатьXDTO(Результат);
		
		ТаблицаДанных = ВебСервис.GetConfirmations(СериализованнаяТаблица);
		Результат = Сериализатор.ПрочитатьXDTO(ТаблицаДанных);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВремТЗ.BIR,
		|	ВремТЗ.ЗаявкаОдобрена,
		|	ВремТЗ.ЦентральныйИдентификатор
		|ПОМЕСТИТЬ Врем
		|ИЗ &ВремТЗ КАК ВремТЗ
		|;
		|ВЫБРАТЬ
		|	Врем.ЗаявкаОдобрена,
		|	Спр.Ссылка
		|ИЗ Врем КАК Врем
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Renault_ЦентрализованныеАкции КАК Спр
		|	ПО Врем.ЦентральныйИдентификатор = Спр.ЦентральныйИдентификатор
		|	И Врем.BIR = Спр.Владелец.BIR";
		Запрос.УстановитьПараметр("ВремТЗ", Результат);
		
		Таблица = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Строка ИЗ Таблица Цикл
			Если Строка.ЗаявкаОдобрена = Истина Тогда
				СпрОбъект = Строка.Ссылка.ПолучитьОбъект();
				СпрОбъект.УчастиеПодтверждено = Истина;
				СпрОбъект.Записать();
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьОбновления() Экспорт
	
	ВебСервис = ПолучитьВебСервис();
	
	ИдентификаторИБ = Константы.Renault_BIR_db.Получить();
	Если НЕ ЗначениеЗаполнено(ИдентификаторИБ) Тогда
		Возврат;
	КонецЕсли;
	СтрокаБИРов = "";
	ВыборкаДЦ = Справочники.CRM_ДилерскиеЦентры.Выбрать();
	Пока ВыборкаДЦ.Следующий() Цикл
		Если ВыборкаДЦ.BIR <> "" И ВыборкаДЦ.ПометкаУдаления = Ложь Тогда
			СтрокаБИРов = СтрокаБИРов + ВыборкаДЦ.BIR + ";";
		КонецЕсли;
	КонецЦикла;
	Если Прав(СтрокаБИРов, 1) = ";" Тогда
		СтрокаБИРов = Лев(СтрокаБИРов, СтрДлина(СтрокаБИРов)-1);
	КонецЕсли;
	ТаблицаДанныхXDTO = ВебСервис.GetChanges(ИдентификаторИБ, СтрокаБИРов);
	Сериализатор = Новый СериализаторXDTO(ВебСервис.ФабрикаXDTO);
	ТаблицаДанных = Сериализатор.ПрочитатьXDTO(ТаблицаДанныхXDTO);
	
	//Для Каждого СтрокаДанных ИЗ ТаблицаДанных Цикл
	//	
	//	Поиск = Справочники.Renault_ЦентрализованныеАкции.НайтиПоРеквизиту("ЦентральныйИдентификатор", СтрокаДанных.СсылкаИдентификатор);
	//	
	//	 если изменена имеющаяся акция
	//	Если ЗначениеЗаполнено(Поиск) Тогда
	//		Запись = РегистрыСведений.CRM_НовостиДилеров.СоздатьМенеджерЗаписи();
	//		Запись.ДилерскийЦентр = Поиск.ДилерскийЦентр;
	//		Запись.ДатаНачалаПоказа = ТекущаяДата();
	//		Запись.ДатаОкончанияПоказа = ДобавитьМесяц(Запись.ДатаНачалаПоказа, 1);
	//		СтрокаИзменений = "";
	//		Для Каждого СтрокаМодели ИЗ СтрокаДанных.Модели Цикл
	//			ИскомаяСтрока = Поиск.Модели.Найти(СтрокаМодели.УИД, "ЦентральныйУИД");
	//			Если ИскомаяСтрока <> Неопределено Тогда
	//				Если ИскомаяСтрока.СтоимостьВсего <> СтрокаМодели.СтоимостьВсего Тогда
	//					СтрокаИзменений = СтрокаИзменений + "<P> По модели " + ИскомаяСтрока.Модель + " изменена стоимость. Новая стоимость: " + СтрокаМодели.СтоимостьВсего + "</P>";
	//				КонецЕсли;
	//			КонецЕсли;
	//		КонецЦикла;
	//		ТекстНовости = "<HTML> <HEAD> </HEAD> <BODY> В акцию " + Поиск.Наименование + " внесены изменения";
	//		Если СтрокаИзменений <> "" Тогда
	//			ТекстНовости = ТекстНовости + СтрокаИзменений;
	//		КонецЕсли;
	//		ТекстНовости = ТекстНовости + "</BODY></HTML>";
	//		Запись.ЗаголовокНовости = "Централизованные акции: " + Поиск.Наименование;
	//		Запись.ТекстНовости = ТекстНовости;
	//		Запись.ДоступнаСервису = Истина;
	//		Запись.ИдентификаторНовости = Новый УникальныйИдентификатор;
	//		Запись.Записать();
	//		
	//	// если добавлена новая акция
	//	Иначе
	//		Запись = РегистрыСведений.CRM_НовостиДилеров.СоздатьМенеджерЗаписи();
	//		Запись.ДатаНачалаПоказа = ТекущаяДата();
	//		Запись.ДатаОкончанияПоказа = ДобавитьМесяц(Запись.ДатаНачалаПоказа, 1);
	//		Запись.ЗаголовокНовости = "Централизованные акции:" + СтрокаДанных.Наименование;
	//		Запись.ТекстНовости = "<HTML> <HEAD> </HEAD> <BODY> Добавлена новая акция</BODY></HTML>";
	//		Запись.ДоступнаСервису = Истина;
	//		Запись.ИдентификаторНовости = Новый УникальныйИдентификатор;
	//		Запись.Записать();
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	ЗаписатьДанныеВБазу(ТаблицаДанных);
	
КонецПроцедуры
